Repository: DevOpenWRT-Router/luci-app-tn-watchdog
Catalog: po/*/watchdog.po
Languages: ru

source: Device
ru: Устройство

source: On this page you may configure watchdog settings.
ru: На этой странице можно выполнить настройку параметров сторожевого таймера (watchdog).

source: Period
ru: Период

source: Scheduling 'nice' value
ru: Значение «nice»

source: Scheduling policy
ru: Политика планировщика задач

source: Scheduling priority
ru: Приоритет задачи

source: This parameter specifies the nice value to be set when specifying scheduling policy as SCHED_OTHER. The nice value is a number in the range -20 (high priority) to +19 (low priority).
ru: Данный параметр определяет значение «nice» для политики SCHED_OTHER. Значение «nice» является числом в диапазоне от -20 (высокий приоритет) до +19 (низкий приоритет).

source: This parameter specifies the static priority to be set when specifying scheduling policy as SCHED_FIFO or SCHED_RR. The allowed range of priorities usually is in the range 1 (low priority) to 99 (high priority).
ru: Данный параметр определяет значение приоритета для политик SCHED_FIFO и SCHED_RR. Значение приоритета является числом в диапазоне от 1 (низкий приоритет) до 99 (высокий приоритет).

source: Timeout
ru: Таймаут

source: Timeout value in seconds. If the watchdog is not resetted within the specified time, the system will be rebooted.
ru: Значение таймаута в секундах. Если сторожевой таймер не сбрасывается в течении указанного времени, система будет перезагружена.

source: Watchdog
ru: Сторожевой таймер

source: Watchdog Settings
ru: Настройки сторожевого таймера

source: Watchdog period cannot be less than timeout
ru: Период не может быть меньше таймаута

source: Watchdog reset interval in seconds.
ru: Интервал сброса сторожевого таймера в секундах.
